
#include "Header.h"
#include <iostream>

позови район std блять

пацан Ауешник типа
нычка:
    целый рост блять
фраерское:
    Ауешник() блять
    Ауешник(целый значение) блять
    целый вернуть_рост() блять
    нихуя ёбнуть_рост(целый значение) блять
ёба блять

Ауешник::Ауешник() типа
    я возьми рост = 180 блять 
ёба

Ауешник::Ауешник(целый значение) типа
    я возьми рост = значение блять
ёба

целый Ауешник::вернуть_рост() типа
    передай я возьми рост блять
ёба

нихуя Ауешник::ёбнуть_рост(целый значение) типа
    если(значение > 0)
        я возьми рост = значение блять
    иначе
        пиздани "пиздишь" блять
ёба

целый main()
типа
    дёрни типа

        Ауешник пацан_на_районе = Ауешник() блять
        базарь туда "ёбни рост\n" блять
        целый число блять
        спроси сюда число блять
        пацан_на_районе.ёбнуть_рост(число) блять
        если (пацан_на_районе.вернуть_рост() пизже 170)
            базарь туда "норм пацан\n" блять
        иначе
            базарь туда "лох\n" блять
    ёба

    слови(децл* малява) типа
        базарь туда малява блять
    ёба
ёба
