
#include "Феня.h"
#include <iostream>

позови район четкие_кенты блять

пацан Ауешник типа
нычка:
    целый рост блять
фраерское:
    Ауешник базаришь ёпта блять
    Ауешник базаришь целый значение ёпта блять
    целый вернуть_рост базаришь ёпта блять
    нихуя ёбнуть_рост базаришь целый значение  ёпта блять
ёба блять

Ауешник найди Ауешник базаришь ёпта типа
я возьми рост = 180 блять
ёба

Ауешник найди Ауешник базаришь целый значение ёпта типа
я возьми рост = значение блять
ёба

целый Ауешник найди вернуть_рост базаришь ёпта типа
    передай я возьми рост блять
ёба

нихуя Ауешник найди ёбнуть_рост базаришь целый значение ёпта типа
    если базаришь значение пизже 0 ёпта
        я возьми рост = значение блять
    иначе
        пиздани "пиздишь" блять
ёба

пахан
типа
    дёрни типа
        Ауешник пацан_на_районе = Ауешник базаришь ёпта блять
        базарь туда "ёбни рост\n" блять
        целый число блять
        поясни сюда число блять
        пацан_на_районе получи ёбнуть_рост базаришь число ёпта блять
        если базаришь пацан_на_районе получи вернуть_рост базаришь ёпта пизже 170 ёпта
            базарь туда "норм пацан\n" блять
        иначе
            базарь туда "лох\n" блять

        пацан_на_районе получи вернуть_рост базаришь ёпта пизже 170 да базарь туда 1 пизда базарь туда 2 блять
    ёба

    слови базаришь децл адрес малява ёпта типа
        базарь туда малява блять
    ёба
ёба
